# Join

In [7]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]})
var2 = pd.DataFrame({"C":[10,20,30], "D":[11,2,3]})

var1.join(var2)

   A    B     C     D
0  1    1  10.0  11.0
1  2   22  20.0   2.0
2  3   33  30.0   3.0
3  4  444   NaN   NaN

In [16]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]}, index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20], "D":[11,2]}, index= ["a", "b"])

var2.join(var1)

    C   D  A   B
a  10  11  1   1
b  20   2  2  22

In [17]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]}, index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20], "D":[11,2]}, index= ["a", "b"])

var2.join(var1, how = "right")

      C     D  A    B
a  10.0  11.0  1    1
b  20.0   2.0  2   22
c   NaN   NaN  3   33
d   NaN   NaN  4  444

In [19]:
# Outer works as Union and Inner works as Inersection

var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]}, index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20], "D":[11,2]}, index= ["a", "b"])

var2.join(var1, how = "outer")

      C     D  A    B
a  10.0  11.0  1    1
b  20.0   2.0  2   22
c   NaN   NaN  3   33
d   NaN   NaN  4  444

In [22]:
# to handle the nameerror of common name for columns
# we can use lsuffix to change the column names

var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]}, index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20], "B":[11,2]}, index= ["a", "b"])

var2.join(var1, how= "outer", lsuffix="_to", rsuffix="_me")

      C  B_to  A  B_me
a  10.0  11.0  1     1
b  20.0   2.0  2    22
c   NaN   NaN  3    33
d   NaN   NaN  4   444

# Append

In [23]:
# Used to add two dataframes
# Major difference between join an append function
# Column values same error was in the join function but there is no such error for append function

In [24]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[1,22,33,444]}, index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20], "B":[11,2]}, index= ["a", "b"])

var1.append(var2)

C:\Users\Yash\AppData\Local\Temp\ipykernel_21776\2145971850.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var1.append(var2)

     A    B     C
a  1.0    1   NaN
b  2.0   22   NaN
c  3.0   33   NaN
d  4.0  444   NaN
a  NaN   11  10.0
b  NaN    2  20.0

In [25]:
# to ignore index

var1.append(var2, ignore_index=True)

C:\Users\Yash\AppData\Local\Temp\ipykernel_21776\2918291356.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var1.append(var2, ignore_index=True)

     A    B     C
0  1.0    1   NaN
1  2.0   22   NaN
2  3.0   33   NaN
3  4.0  444   NaN
4  NaN   11  10.0
5  NaN    2  20.0

# Groupby

In [27]:
var = pd.DataFrame({"name": ["a","b","c","d","a","b","a","b","c","c","d","a"], "sno1": [23,34,55,55,33,45,34,56,35,24,53,56]})

var

   name  sno1
0     a    23
1     b    34
2     c    55
3     d    55
4     a    33
5     b    45
6     a    34
7     b    56
8     c    35
9     c    24
10    d    53
11    a    56

In [30]:
# here we can group data by aa bb cc such way using groupby function

var_new = var.groupby("name")

var_new

In [33]:
# how to show that groupby output

for x,y in var_new:
    print(x)
    print(y)
    print()

a
   name  sno1
0     a    23
4     a    33
6     a    34
11    a    56

b
  name  sno1
1    b    34
5    b    45
7    b    56

c
  name  sno1
2    c    55
8    c    35
9    c    24

d
   name  sno1
3     d    55
10    d    53

In [35]:
var_new.get_group("d")

   name  sno1
3     d    55
10    d    53

In [36]:
var_new.min()

      sno1
name
a       23
b       34
c       24
d       53

In [37]:
var_new.max()

      sno1
name
a       56
b       56
c       55
d       55

In [38]:
var_new.mean()

      sno1
name
a     36.5
b     45.0
c     38.0
d     54.0

In [39]:
# convert that data into list

li = list(var_new)
li

[('a',
     name  sno1
  0     a    23
  4     a    33
  6     a    34
  11    a    56),
 ('b',
    name  sno1
  1    b    34
  5    b    45
  7    b    56),
 ('c',
    name  sno1
  2    c    55
  8    c    35
  9    c    24),
 ('d',
     name  sno1
  3     d    55
  10    d    53)]